#include <iostream>
#include "vector.h"
using namespace std;

void main()
{
	setlocale(LC_ALL, "");
	cout << "Мулiк Рустам IС - 93\n_______________________________________\n";

	MyVector z1;   // використання конструктора за змовчуванням
	MyVector z2(7.5, 60);  // використання конструктора з параметрами
	MyVector z3(z2);  // використання конструктора копіювання
	cout << "Z1() - використання конструктора за змовчуванням\n" << z1;
	cout << "Z2(7.5, 60) - використання конструктора з параметрами\n" << z2;
	cout << "Z3(Z2) - використання конструктора копiювання\n" << z3;
	z3 *= 2;
	cout << "збiльшення у 2 рази довжини об’єкта Z3\n" << z3;
	z3.Povorot(90);
	cout << "поворот Z3 на 90°\n" << z3;
	z2 += z3;
	z1 = z2;
	cout << "Z1 = Z2 + Z3\n";
	cout << z1 << "\nВектор Z1\nДовжина: " << z1.Len() << "\nКут: " << z1.Ang() << endl << endl;

	system("pause");
}